driver-tests/bpelse/nmproperty/FromToPropertySpecJBI/src/jbiasa/FromToPropertySpec/inLineSyntax/InLinedparentservice.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="InLinedparentService" targetNamespace="http://j2ee.netbeans.org/wsdl/InLinedparentService"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/InLinedparentService" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="InLinedparentServiceOperationRequest">
        <part name="part1" type="xsd:string"/>
        <part name="part2" type="xsd:int"/>
    </message>
    <message name="InLinedparentServiceOperationResponse">
        <part name="part1" type="xsd:string"/>
        <part name="part2" type="xsd:int"/>
    </message>
    <portType name="InLinedparentServicePortType">
        <operation name="InLinedparentServiceOperation">
            <input name="input1" message="tns:InLinedparentServiceOperationRequest"/>
            <output name="output1" message="tns:InLinedparentServiceOperationResponse"/>
        </operation>
    </portType>
    <binding name="InLinedparentServiceBinding" type="tns:InLinedparentServicePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="InLinedparentServiceOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/InLinedparentService"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/InLinedparentService"/>
            </output>
        </operation>
    </binding>
    <service name="InLinedparentServiceService">
        <port name="InLinedparentServicePort" binding="tns:InLinedparentServiceBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/InLinedparentServiceService/InLinedparentServicePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="InLinedparentService">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="InLinedparentServicePortTypeRole" portType="tns:InLinedparentServicePortType"/>
    </plnk:partnerLinkType>
</definitions>
