driver-tests/bpelse/nmproperty/FromToPropertySpecJBI/test/InLinedCopyFromToPropBasedTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inl="http://j2ee.netbeans.org/wsdl/InLinedparentService">
  <soapenv:Body>
    <inl:InLinedparentServiceOperation>
      <part1>Hello</part1>
      <part2>4</part2>
    </inl:InLinedparentServiceOperation>
  </soapenv:Body>
</soapenv:Envelope>